In [1]:
# Importing Pandas and Numpy libraries
import pandas as pd
import numpy as np

In [2]:
# creating Series
sales1 = pd.Series([100, 200, 300, 400], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales2 = pd.Series([150, 240, 410, 490], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales3 = pd.Series([300, 400, 500, 600], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])

In [3]:
# Creating Dataframe
dataframe1 = pd.DataFrame({2017: sales1, 2018: sales2, 2019: sales3})
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [4]:
# reset our index
dataframe2 = dataframe1.reset_index()
dataframe2

       index  2017  2018  2019
0  Microsoft   100   150   300
1   Facebook   200   240   400
2     Amazon   300   410   500
3     Google   400   490   600

In [6]:
# set_index() to set new index of dataframe
dataframe2.set_index(2017)

          index  2018  2019
2017
100   Microsoft   150   300
200    Facebook   240   400
300      Amazon   410   500
400      Google   490   600

In [13]:
new_index = dataframe1.reindex(index=['Microsoft', 'Google', 'T', 'F'])
new_index

            2017   2018   2019
Microsoft  100.0  150.0  300.0
Google     400.0  490.0  600.0
T            NaN    NaN    NaN
F            NaN    NaN    NaN

In [8]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600